# PANDAS

Pandas es una librería escrita como extensión de NumPy para manipulación y análisis de Datos en Python.  
**coda install pandas** // **pip install pandas**

In [5]:
import numpy as np
import pandas as pd

In [7]:
#Series
etiquetas = ['a', 'b', 'c']
datos = [2,4,6]
#creamos ahora una serie mediante pandas, pasando los datos y los valores
pd.Series(data=datos, index=etiquetas)

a    2
b    4
c    6
dtype: int64

In [9]:
#se puede construir a partir de una array

In [15]:
array = np.arange(5,9)
pd.Series(array)
#al no pasar etiquetas pone secuencial desde 0 las etiquetas.

0    5
1    6
2    7
3    8
dtype: int32

In [21]:
array = np.arange(5,9)
etiquetas = ['venta1', 'venta2', 'venta3','venta4']
serie1= pd.Series(array,etiquetas)
serie1

venta1    5
venta2    6
venta3    7
venta4    8
dtype: int32

In [27]:
serie1['venta2']  #accedemos a los datos a trave´s de su etiqueta

6

In [33]:
#acceder por posicion
serie1[0]

C:\Users\CPU\AppData\Local\Temp\ipykernel_16804\2518977759.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  serie1[0]

5

In [35]:
#los datos dentro de una serie pueden ser de diferntes tipos.

datos2 = ['informatica',300, 'rrhh',25.5]
pd.Series(datos2,etiquetas)

venta1    informatica
venta2            300
venta3           rrhh
venta4           25.5
dtype: object

In [65]:
#se pueden sumar las series

serie1= pd.Series([1,2,3,4],['ventas1','ventas2','ventas3','ventas4'])
serie2= pd.Series([5,9,6],['ventas1','ventas2','ventas3'])

serie_suma = serie1 + serie2  #suma los valores del data en cada serie apoyandose en las etiquetas, si no tiene asignada da valor nulo
serie_suma

ventas1     6.0
ventas2    11.0
ventas3     9.0
ventas4     NaN
dtype: float64

In [55]:
#crear una serie desde un diccionario
dicc = {'a': 1, 'b': 2, 'c': 3}
tabla = pd.Series(data=dicc, index=['a', 'b', 'c'])
tabla

a    1
b    2
c    3
dtype: int64

## DATAFRAMES

In [68]:
import numpy as np
import pandas as pd

In [70]:
filas = ['ventas1','ventas2','ventas3']
columnas = ['zonaA','zonaB','zonaC']
datos = [[123,456,789],[100,200,300],[10,20,30]]  #datos en este caso 3x3

In [76]:
dataframe = pd.DataFrame(datos,filas, columnas)
#me crea la tabla con las filas, las columnas y los datos
dataframe

         zonaA  zonaB  zonaC
ventas1    123    456    789
ventas2    100    200    300
ventas3     10     20     30

In [82]:
# para seleccionar la primera fila
dataframe.loc['ventas1']

zonaA    123
zonaB    456
zonaC    789
Name: ventas1, dtype: int64

In [86]:
dataframe.loc[['ventas1','ventas3']] #para sacar dos filas de valoers, dobles []ya que es una lista de valores

         zonaA  zonaB  zonaC
ventas1    123    456    789
ventas3     10     20     30

In [88]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    456    789
ventas2    100    200    300
ventas3     10     20     30

In [90]:
#columna
dataframe['zonaB']

ventas1    456
ventas2    200
ventas3     20
Name: zonaB, dtype: int64

In [92]:
dataframe[['zonaA','zonaC']]

         zonaA  zonaC
ventas1    123    789
ventas2    100    300
ventas3     10     30

In [100]:
dataframe.loc['ventas2','zonaC'] #tambien sirve con ['ventas1']['zonaA']

300

In [128]:
#añadir una fila nueva, se llama al dataframe y se le asigna el nombre y se le asignan los valores
dataframe['TotalVentas'] = dataframe['zonaA'] +dataframe['zonaB']+dataframe['zonaC']
dataframe

         zonaA  zonaB  zonaC  TotalZona  TotalVentas
ventas1    123    456    789       1368         1368
ventas2    100    200    300        600          600
ventas3     10     20     30         60           60

In [130]:
#Borrar de la visulaciación
dataframe.drop('TotalVentas', axis=1)  #axis=1 indica que es una columna

         zonaA  zonaB  zonaC  TotalZona
ventas1    123    456    789       1368
ventas2    100    200    300        600
ventas3     10     20     30         60

In [132]:
#Borrar definitivamente
dataframe.drop('TotalVentas', axis=1, inplace=True)  #axis=1 indica que es una columna

In [134]:
dataframe

         zonaA  zonaB  zonaC  TotalZona
ventas1    123    456    789       1368
ventas2    100    200    300        600
ventas3     10     20     30         60

In [136]:
#borrar una fila-->
dataframe.drop('ventas3') #no hace falta poner axis ya que por defente es axis=0

         zonaA  zonaB  zonaC  TotalZona
ventas1    123    456    789       1368
ventas2    100    200    300        600

In [138]:
#lo mismo para borrar definitivamente
dataframe.drop('ventas3', inplace=True)

In [140]:
dataframe

         zonaA  zonaB  zonaC  TotalZona
ventas1    123    456    789       1368
ventas2    100    200    300        600

In [144]:
#ver el tamaño del dataframe
dataframe.shape

(2, 4)

### Dataframes: Selección de datos con una condición

In [153]:
import pandas as pd

In [157]:
filas = 'ventas1 ventas2 ventas3'.split()  
#con el mtd split creamos una lista de valores con palabras separadas por espacio, es más cómodo
filas

['ventas1', 'ventas2', 'ventas3']

In [163]:
columnas = 'zonaA zonaB zonaC '.split()
columnas

['zonaA', 'zonaB', 'zonaC']

In [171]:
datos = [[120,130,140],[50,55,60],[100,200,30]]
datos

[[120, 130, 140], [50, 55, 60], [100, 200, 30]]

In [175]:
dataframe=pd.DataFrame(datos,filas,columnas)

In [177]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    130    140
ventas2     50     55     60
ventas3    100    200     30

In [181]:
#condición
condicion = dataframe >100
dataframe[condicion]  #donde no se cumple la condición devuelve NaN

         zonaA  zonaB  zonaC
ventas1  120.0  130.0  140.0
ventas2    NaN    NaN    NaN
ventas3    NaN  200.0    NaN

In [187]:
condicion = dataframe['zonaA']>=100
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    120    130    140
ventas3    100    200     30

In [199]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    130    140
ventas2     50     55     60
ventas3    100    200     30

In [201]:
#condicion doble ()&()
condicion = (dataframe['zonaA']>=100) &(dataframe['zonaB']>150)
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas3    100    200     30

In [203]:
#condicion OR
condicion = (dataframe['zonaA']>=100) | (dataframe['zonaB']>150)
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    120    130    140
ventas3    100    200     30

In [205]:
dataframe[condicion]['zonaB'] #hacemos la selección y luego muestra la columna que queremos

ventas1    130
ventas3    200
Name: zonaB, dtype: int64

In [207]:
dataframe[condicion][['zonaB','zonaC']]

         zonaB  zonaC
ventas1    130    140
ventas3    200     30

### Dataframes: modificación de los nombres de las filas

In [212]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    130    140
ventas2     50     55     60
ventas3    100    200     30

In [218]:
nuevas_filas ='dia1 dia2 dia3'.split()

In [222]:
dataframe['dias'] = nuevas_filas  #creamos una nueva columna con esos valores

In [224]:
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    120    130    140  dia1
ventas2     50     55     60  dia2
ventas3    100    200     30  dia3

In [233]:
dataframe.set_index('dias')  #le pasamos los valores de la columna dias a index del dataframe

      zonaA  zonaB  zonaC
dias
dia1    120    130    140
dia2     50     55     60
dia3    100    200     30

In [235]:
#si vemos el dataframe sigue igual, no lo sobreescribe, para ello
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    120    130    140  dia1
ventas2     50     55     60  dia2
ventas3    100    200     30  dia3

In [237]:
#ejecutar de forma permanente
dataframe = dataframe.set_index('dias')

In [239]:
dataframe

      zonaA  zonaB  zonaC
dias
dia1    120    130    140
dia2     50     55     60
dia3    100    200     30

### Dataframes: tratamiento datos nulos o sin valor dentro de Pandas

In [ ]:
#creamos un dataframe a partir de un dicc

In [242]:
import numpy as np
import pandas as pd

In [254]:
diccionario ={'A':[4,5,np.nan],'B':[60,30,20],'C':[np.nan, 8, np.nan]}
#np.nan representa un valor nulo en numpy

In [260]:
dataframe=pd.DataFrame(diccionario)

In [262]:
dataframe

     A   B    C
0  4.0  60  NaN
1  5.0  30  8.0
2  NaN  20  NaN

In [264]:
dataframe.dropna()  #borra los datos perdidos o sin valor

     A   B    C
1  5.0  30  8.0

In [266]:
dataframe.dropna(axis=1)  #elimina las columnas con valores nulos

    B
0  60
1  30
2  20

In [268]:
dataframe

     A   B    C
0  4.0  60  NaN
1  5.0  30  8.0
2  NaN  20  NaN

In [ ]:
#si queremos que el cambio sea definitivo inplace=True

In [270]:
#si queremos darle valor a los valores Nulos
#Fill NA/NaN values using the specified method.

In [278]:
dataframe.fillna(value=100)

       A   B      C
0    4.0  60  100.0
1    5.0  30    8.0
2  100.0  20  100.0

In [280]:
valor_medio = dataframe.mean()
valor_medio

A     4.500000
B    36.666667
C     8.000000
dtype: float64

In [284]:
dataframe.fillna(value=valor_medio) #rellena con el valor medio por columna

     A   B    C
0  4.0  60  8.0
1  5.0  30  8.0
2  4.5  20  8.0

### Agrupación de los datos

In [289]:
import numpy as np
import pandas as pd

In [293]:
diccionario ={'dias':['dia1','dia1','dia2','dia2','dia3'],\
              'vendedores':['Tonio','Maria','Jose','Marta','Juan'],\
             'ventas':[100,400,200,500,300,]}

In [295]:
dataframe = pd.DataFrame(diccionario)
dataframe

   dias vendedores  ventas
0  dia1      Tonio     100
1  dia1      Maria     400
2  dia2       Jose     200
3  dia2      Marta     500
4  dia3       Juan     300

In [297]:
#si queremos agrupar los datos de ventas por dias, por ejemplo

In [328]:
dataframe.groupby('dias') #esto genera un objeto de tipo groupby y podemos calcular la suma

In [324]:
dataframe.groupby('dias').sum()

      vendedores  ventas
dias
dia1  TonioMaria     500
dia2   JoseMarta     700
dia3        Juan     300

In [330]:
dataframe.groupby('dias').describe()  #nos da estadísticas

     ventas
      count   mean         std    min    25%    50%    75%    max
dias
dia1    2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
dia2    2.0  350.0  212.132034  200.0  275.0  350.0  425.0  500.0
dia3    1.0  300.0         NaN  300.0  300.0  300.0  300.0  300.0

### Combinar Dataframres

In [333]:
diccionario ={'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]}

In [335]:
dataframe1 = pd.DataFrame(diccionario)

In [337]:
dataframe1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [341]:
diccionario2 ={'A':[11,12,13],'B':[14,15,16],'C':[17,18,19]}
dataframe2 = pd.DataFrame(diccionario2)
dataframe2

    A   B   C
0  11  14  17
1  12  15  18
2  13  16  19

In [343]:
#concatenar dataframes ya que tienen el mismo numero de columnas y filas
pd.concat([dataframe1,dataframe2])
#pone uno debajo del otro

    A   B   C
0   1   4   7
1   2   5   8
2   3   6   9
0  11  14  17
1  12  15  18
2  13  16  19

In [353]:
#para hacerlo al lado del otro
pd.concat([dataframe1,dataframe2], axis=1)

   A  B  C   A   B   C
0  1  4  7  11  14  17
1  2  5  8  12  15  18
2  3  6  9  13  16  19

### Merge Dataframes

In [367]:
diccionario1 ={'A':[11,12,13],'B':[14,15,16],'Clave':['c1','c2','c3']}
dataframe1 = pd.DataFrame(diccionario1)

In [369]:
dataframe1

    A   B Clave
0  11  14    c1
1  12  15    c2
2  13  16    c3

In [373]:
diccionario2 ={'C':[1,2,3],'D':[4,5,6],'Clave':['c1','c2','c3']}
dataframe2 = pd.DataFrame(diccionario2)
dataframe2

   C  D Clave
0  1  4    c1
1  2  5    c2
2  3  6    c3

In [ ]:
#dos dataframe con las mismas columna de Clave

In [375]:
pd.merge(dataframe1, dataframe2, on='Clave')
#usamos la columna Clave para unir ambos dataframes

    A   B Clave  C  D
0  11  14    c1  1  4
1  12  15    c2  2  5
2  13  16    c3  3  6

### Join Dataframes

In [380]:
diccionario ={'A':[1,2,3],'B':[4,5,6]}
dataframe1 = pd.DataFrame(diccionario)
dataframe1

   A  B
0  1  4
1  2  5
2  3  6

In [388]:
diccionario ={'A':[1,2,3],'B':[4,5,6]}
dataframe1 = pd.DataFrame(diccionario, index = ['fila1','fila2','fila3'])  #le pasamos unos indices a las filas
dataframe1

       A  B
fila1  1  4
fila2  2  5
fila3  3  6

In [398]:
diccionario2 ={'C':[10,20,30],'D':[40,50,60]}
dataframe2 = pd.DataFrame(diccionario2, index = ['fila1','fila2','fila3'])  #le ponemos el mismo indice que antes
dataframe2

        C   D
fila1  10  40
fila2  20  50
fila3  30  60

In [402]:
#dos dataframes con los mismo indices y diferentes columnas, hacemos un join

dataframe1.join(dataframe2)

       A  B   C   D
fila1  1  4  10  40
fila2  2  5  20  50
fila3  3  6  30  60

## Operaciones con Dataframes

In [412]:
diccionario ={'A':[11,12,10,12],'B':[14,18,16,17]}
dataframe=pd.DataFrame(diccionario, index =['i1','i2','i3','i4'])
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [414]:
#vemos que tenemos valores repetidos en la columna A
dataframe['A'].unique()  #nos da los valores únicos

array([11, 12, 10], dtype=int64)

In [418]:
dataframe['A'].nunique() #nos cuenta cuantos valores son únicos, en este caso 3

3

In [420]:
dataframe['A'].value_counts()   #nos cuenta las coincidencias

A
12    2
11    1
10    1
Name: count, dtype: int64

In [422]:
def multiplicar(x):
    return x*2

dataframe['A'].apply(multiplicar)  #nos aplicar la funcion multiplicar a la columna A

i1    22
i2    24
i3    20
i4    24
Name: A, dtype: int64

In [426]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
i4  12  17

In [430]:
#esto tb se puede hacer con la funcion lambda

In [434]:
dataframe['A'].apply(lambda x: x*10)

i1    110
i2    120
i3    100
i4    120
Name: A, dtype: int64

In [436]:
#borrar una columna 
dataframe.drop('B', axis =1)  #para columnas axis=1 para filas es axis=0 por defecto

     A
i1  11
i2  12
i3  10
i4  12

In [440]:
dataframe.drop('i3')

     A   B
i1  11  14
i2  12  18
i4  12  17

In [448]:
dataframe.columns

Index(['A', 'B'], dtype='object')

In [450]:
dataframe.index

Index(['i1', 'i2', 'i3', 'i4'], dtype='object')

In [452]:
dataframe.sort_values('B')  #ordena por volores según la columna B

     A   B
i1  11  14
i3  10  16
i4  12  17
i2  12  18

## Importar Ficheros csv, excell, html

In [4]:
#Pandas - ficheros Excel

In [20]:
import pandas as pd

In [ ]:
#para ver en que directorio estamos (este comando tiene que ir solo sin comentarios)

In [18]:
pwd

'C:\\Users\\CPU\\Jupiter-docus'

In [22]:
ls

 El volumen de la unidad C es OS
 El n£mero de serie del volumen es: F45D-8185

 Directorio de C:\Users\CPU\Jupiter-docus

01/08/2024  09:51    <DIR>          .
01/08/2024  09:51    <DIR>          ..
01/08/2024  09:47    <DIR>          .ipynb_checkpoints
20/07/2024  23:03            30.718 01-apuntes-basicos.ipynb
01/08/2024  09:50    <DIR>          01-DataScience-Udemy
21/07/2024  20:35            25.146 02.apuntes-numpy.ipynb
20/07/2024  13:00    <DIR>          02-MachineLearning-Udemy
01/08/2024  09:51           109.625 03.apuntes.Pandas.ipynb
01/08/2024  09:48               617 04.Matplotlib-analisis de datos.ipynb
20/07/2024  13:00    <DIR>          1ndsessiontechnical
20/07/2024  13:00    <DIR>          2ndsessiontechnical
09/07/2024  13:31    <DIR>          3ndsessiontechnical
18/07/2024  13:41    <DIR>          4ndsessiontechnical
21/07/2024  23:38             5.508 Ejemplo_excel.xlsx
20/07/2024  12:49    <DIR>          Seccion6_Tarea
               5 archivos        171.614 bytes
              10 dirs  71.570.735.104 bytes libres

In [ ]:
#vemos que tenemos el fichero xlsx para importar sus datos, el nombre del fichero entre comillas

In [26]:
dataframe = pd.read_excel('Ejemplo_excel.xlsx')
dataframe

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [28]:
#añadimos una columna y guardamos el archivo en excell de nuevo

In [35]:
dataframe['e'] =[5,5,5,5]

In [37]:
dataframe

   Unnamed: 0   a   b   c   d  e
0           0   0   1   2   3  5
1           1   4   5   6   7  5
2           2   8   9  10  11  5
3           3  12  13  14  15  5

In [39]:
dataframe.to_excel('salida.xlsx', sheet_name='Datos1')

In [41]:
ls

 El volumen de la unidad C es OS
 El n£mero de serie del volumen es: F45D-8185

 Directorio de C:\Users\CPU\Jupiter-docus

01/08/2024  09:57    <DIR>          .
01/08/2024  09:57    <DIR>          ..
01/08/2024  09:47    <DIR>          .ipynb_checkpoints
20/07/2024  23:03            30.718 01-apuntes-basicos.ipynb
01/08/2024  09:50    <DIR>          01-DataScience-Udemy
21/07/2024  20:35            25.146 02.apuntes-numpy.ipynb
20/07/2024  13:00    <DIR>          02-MachineLearning-Udemy
01/08/2024  09:55           113.357 03.apuntes.Pandas.ipynb
01/08/2024  09:48               617 04.Matplotlib-analisis de datos.ipynb
20/07/2024  13:00    <DIR>          1ndsessiontechnical
20/07/2024  13:00    <DIR>          2ndsessiontechnical
09/07/2024  13:31    <DIR>          3ndsessiontechnical
18/07/2024  13:41    <DIR>          4ndsessiontechnical
21/07/2024  23:38             5.508 Ejemplo_excel.xlsx
01/08/2024  09:57             5.091 salida.xlsx
20/07/2024  12:49    <DIR>          Seccion6_Tarea
               6 archivos        180.437 bytes
              10 dirs  71.326.744.576 bytes libres

In [ ]:
#se graba el fichero nuevo con los datos nuevos y con el nombre de la hoja ya definido

In [ ]:
## Ficheros desde HTML
#definimos la variable con la web donde está la tabla que queremos extraer: https://es.wikipedia.org/wiki/Anexo:Pa%C3%ADses_y_territorios_dependientes_por_poblaci%C3%B3n

In [43]:
pagina_web ='https://es.wikipedia.org/wiki/Anexo:Pa%C3%ADses_y_territorios_dependientes_por_poblaci%C3%B3n'

In [49]:
datos = pd.read_html(pagina_web)

In [51]:
datos

[     N.º                   País (o territorio dependiente)  \
 0      1                                        China[12]​
 1      2                                             India
 2      3                                    Estados Unidos
 3      4                                         Indonesia
 4      5                                          Pakistán
 ..   ...                                               ...
 241  242                           Islas Cocos (Australia)
 242  243  Islas Ultramarinas Menores de los Estados Unidos
 243  244                               Islas Pitcairn (RU)
 244  NaN                                             Mundo
 245   N°                   País (o territorio dependiente)

     Proyección exponencial de la población al 1/7/2024[7]​  \
 0                                        1 408 628 000
 1                                        1 404 910 000
 2                                          336 762 000
 3                                          288 431 000
 4                                          249 805 000
 ..                                                 ...
 241                                                600
 242                                                100
 243                                                 50
 244                                      8 014 986 000
 245  Proyección exponencial de la población al 1/7/...

      Total mun- dial (%) Cambio medio anual (%)[8]​  \
 0                   1757                       -015
 1                   1753                        090
 2                    420                        052
 3                    360                        172
 4                    312                        256
 ..                   ...                        ...
 241                  000                        174
 242                  000                       -496
 243                  000                       -041
 244                10000                        107
 245  Total mun- dial (%)     Cambio medio anual (%)

      Cambio absoluto anual promedio  Cambio medio abs. total anual (%)  \
 0                        -2 077 000                                  -
 1                        12 669 000                               1466
 2                         1 749 000                                202
 3                         4 959 000                                574
 4                         6 403 000                                741
 ..                              ...                                ...
 241                               0                                000
 242                               0                                000
 243                               0                                000
 244                      86 409 000                              10000
 245  Cambio absoluto anual promedio  Cambio medio abs. total anual (%)

     Años para even- tual du- pli- ca- ción[9]​  \
 0                                            -
 1                                           77
 2                                          134
 3                                           41
 4                                           27
 ..                                         ...
 241                                         40
 242                                          -
 243                                          -
 244                                         65
 245     Años para even- tual du- pli- ca- ción

     Censo más reciente, última estimación oficial, proyección de la ONU o reloj de población nacional  \
 0                                        1 409 670 000
 1                                        1 404 910 000
 2                                          336 836 000
 3                                          271 350 000
 4                                          241 499 431
 ..                                                 ...
 241                                                593
 242                                                190
 243                                                 47
 244                                      8 124 869 000
 245  Censo más reciente, última estimación oficial,...

     Fecha de esta última cifra de población en particular (d/mm/aaaa)[10]​  \
 0                                           31/12/2023
 1                                            1/07/2024
 2                                           30/07/2024
 3                                              12/2020
 4                                            1/03/2023
 ..                                                 ...
 241                                         11/08/2021
 242                                          1/04/2010
 243                                          1/07/2021
 244                                         30/07/2024
 245  Fecha de esta última cifra de población en par...

     Tipo[11]​  \
 0           E
 1           A
 2           R
 3           E
 4           C
 ..        ...
 241         C
 242         C
 243         E
 244         R
 245      Tipo

     Enlace o hipervínculo (usualmente de tipo oficial) de esta última cifra de población
 0                                     www.stats.gov.cn
 1                                    main.mohfw.gov.in
 2                                       www.census.gov
 3                                        www.bps.go.id
 4                                       www.pbs.gov.pk
 ..                                                 ...
 241                              www.citypopulation.de
 242                                   www.statoids.com
 243                               www.visitpitcairn.pn
 244                              www.worldometers.info
 245  Enlace o hipervínculo (usualmente de tipo ofic...

 [246 rows x 12 columns],
         Continente, subcontinente o región geográfica  \
 0                                              África
 1                                      África Central
 2                                    África del Norte
 3                                      África del Sur
 4                                   África Occidental
 ..                                                ...
 92  Organización del Tratado del Atlántico Norte (...
 93                                      Países árabes
 94                               Próximos once (N-11)
 95                       Unión Económica Euroasiática
 96      Continente, subcontinente o región geográfica

    Proyección exponencial de la población al 1/7/2024  Total mun- dial (%)  \
 0                                       1 465 510 000                 1828
 1                                         217 382 000                  271
 2                                         261 078 000                  326
 3                                          73 569 000                  092
 4                                         447 105 000                  558
 ..                                                ...                  ...
 92                                        967 899 000                 1208
 93                                        468 979 000                  585
 94                                      1 620 615 000                 2022
 95                                        175 624 000                  219
 96  Proyección exponencial de la población al 1/7/...  Total mun- dial (%)

     Cambio medio anual (%)  Cambio medio absoluto anual  \
 0                      262                   38 476 000
 1                      348                    7 667 000
 2                      172                    4 482 000
 3                      177                    1 298 000
 4                      284                   12 695 000
 ..                     ...                          ...
 92                     053                    5 144 000
 93                     190                    8 909 000
 94                     166                   26 868 000
 95                     027                      478 000
 96  Cambio medio anual (%)  Cambio medio absoluto anual

     Cambio medio abs. total anual (%)  Años para even- tual dupli- ca- ción
 0                                4453                                    27
 1                                 887                                    20
 2                                 519                                    41
 3                                 150                                    40
 4                                1469                                    25
 ..                                ...                                   ...
 92                                595                                   131
 93                               1031                                    37
 94                               3109                                    42
 95                                055                                   257
 96  Cambio medio abs. total anual (%)  Años para even- tual dupli- ca- ción

 [97 rows x 7 columns],
                                                      0  \
 0    Tabla de países y territorios dependientes por...
 1    N° País (o territorio dependiente) Población e...
 2                                                   N°
 3                                                    1
 4                                                    2
 ..                                                 ...
 714                                                234
 715                                                235
 716                                                236
 717                                                237
 718                                                  -

                                                      1  \
 0    Tabla de países y territorios dependientes por...
 1    N° País (o territorio dependiente) Población e...
 2                      País (o territorio dependiente)
 3                                                China
 4                                                India
 ..                                                 ...
 714                                Islas Malvinas (RU)
 715                                          Niue (NZ)
 716                                       Tokelau (NZ)
 717                                Ciudad del Vaticano
 718                                              Mundo

                                                      2                    3
 0    Tabla de países y territorios dependientes por...                  NaN
 1    N° País (o territorio dependiente) Población e...                  NaN
 2    Población estimada por la ONU para mediados de...  % del total mundial
 3                                          543 979 000                 2177
 4                                          357 021 000                 1428
 ..                                                 ...                  ...
 714                                              3 000                  000
 715                                              2 000                  000
 716                                              2 000                  000
 717                                              1 000                  000
 718                                  6 148 898 000 000                10000

 [719 rows x 4 columns],
       N° País (o territorio dependiente)  \
 0      1                           China
 1      2                           India
 2      3                  Estados Unidos
 3      4                           Rusia
 4      5                           Japón
 ..   ...                             ...
 233  234         San Bartolomé (Francia)
 234  235                    Tokelau (NZ)
 235  236             Ciudad del Vaticano
 236  237                 San Martín (PB)
 237    -                           Mundo

     Población estimada por la ONU para mediados del año  1950  \
 0                                          543 979 000
 1                                          357 021 000
 2                                          148 282 000
 3                                          102 580 000
 4                                           84 353 000
 ..                                                 ...
 233                                              2 000
 234                                              2 000
 235                                              1 000
 236                                              1 000
 237                                  2 499 327 000 000

      % del total mundial
 0                   2177
 1                   1428
 2                    593
 3                    410
 4                    338
 ..                   ...
 233                    0
 234                    0
 235                    0
 236                    0
 237                10000

 [238 rows x 4 columns],
       N° País (o territorio dependiente)  \
 0      1                           China
 1      2                           India
 2      3                  Estados Unidos
 3      4                           Rusia
 4      5                       Indonesia
 ..   ...                             ...
 233  234         San Bartolomé (Francia)
 234  235             Islas Malvinas (RU)
 235  236                    Tokelau (NZ)
 236  237             Ciudad del Vaticano
 237    -                           Mundo

     Población estimada por la ONU para mediados del año  1975  \
 0                                          915 125 000
 1                                          623 524 000
 2                                          211 275 000
 3                                          133 842 000
 4                                          131 213 000
 ..                                                 ...
 233                                              3 000
 234                                              2 000
 235                                              2 000
 236                                              1 000
 237                                  4 069 441 000 000

      % del total mundial
 0                   2249
 1                   1532
 2                    519
 3                    329
 4                    322
 ..                   ...
 233                    0
 234                    0
 235                    0
 236                    0
 237                10000

 [238 rows x 4 columns],
       N° País (o territorio dependiente)  \
 0      1                           China
 1      2                           India
 2      3                  Estados Unidos
 3      4                       Indonesia
 4      5                          Brasil
 ..   ...                             ...
 233  234             Islas Malvinas (RU)
 234  235                       Niue (NZ)
 235  236                    Tokelau (NZ)
 236  237             Ciudad del Vaticano
 237    -                           Mundo

     Población estimada por la ONU para mediados del año  2000  \
 0                                        1 264 099 000
 1                                        1 059 634 000
 2                                          282 399 000
 3                                          214 072 000
 4                                          175 874 000
 ..                                                 ...
 233                                              3 000
 234                                              2 000
 235                                              2 000
 236                                              1 000
 237                                  6 148 898 000 000

      % del total mundial
 0                   2056
 1                   1723
 2                    459
 3                    348
 4                    286
 ..                   ...
 233                    0
 234                    0
 235                    0
 236                    0
 237                10000

 [238 rows x 4 columns],
                         0                                    1
 0  Control de autoridades  Proyectos Wikimedia  Datos: Q712280]

In [53]:
type(datos)
#guarda todo como una lista

list

In [ ]:
#accedemos a la primera fila

In [55]:
datos[0]

,N.º,País (o territorio dependiente),Proyección exponencial de la población al 1/7/2024[7]​,Total mun- dial (%),Cambio medio anual (%)[8]​,Cambio absoluto anual promedio,Cambio medio abs. total anual (%),Años para even- tual du- pli- ca- ción[9]​,"Censo más reciente, última estimación oficial, proyección de la ONU o reloj de población nacional",Fecha de esta última cifra de población en particular (d/mm/aaaa)[10]​,Tipo[11]​,Enlace o hipervínculo (usualmente de tipo oficial) de esta última cifra de población
0,1,China[12]​,1 408 628 000,1757,-015,-2 077 000,-,-,1 409 670 000,31/12/2023,E,www.stats.gov.cn
1,2,India,1 404 910 000,1753,090,12 669 000,1466,77,1 404 910 000,1/07/2024,A,main.mohfw.gov.in
2,3,Estados Unidos,336 762 000,420,052,1 749 000,202,134,336 836 000,30/07/2024,R,www.census.gov
3,4,Indonesia,288 431 000,360,172,4 959 000,574,41,271 350 000,12/2020,E,www.bps.go.id
4,5,Pakistán,249 805 000,312,256,6 403 000,741,27,241 499 431,1/03/2023,C,www.pbs.gov.pk
...,...,...,...,...,...,...,...,...,...,...,...,...
241,242,Islas Cocos (Australia),600,000,174,0,000,40,593,11/08/2021,C,www.citypopulation.de
242,243,Islas Ultramarinas Menores de los Estados Unidos,100,000,-496,0,000,-,190,1/04/2010,C,www.statoids.com
243,244,Islas Pitcairn (RU),50,000,-041,0,000,-,47,1/07/2021,E,www.visitpitcairn.pn
244,NaN,Mundo,8 014 986 000,10000,107,86 409 000,10000,65,8 124 869 000,30/07/2024,R,www.worldometers.info
245,N°,País (o territorio dependiente),Proyección exponencial de la población al 1/7/...,Total mun- dial (%),Cambio medio anual (%),Cambio absoluto anual promedio,Cambio medio abs. total anual (%),Años para even- tual du- pli- ca- ción,"Censo más reciente, última estimación oficial,...",Fecha de esta última cifra de población en par...,Tipo,Enlace o hipervínculo (usualmente de tipo ofic...

In [ ]:
#ahí está nuestra información de la tabla

In [59]:
dataframe = datos[0]

In [65]:
dataframe.head(10)

,N.º,País (o territorio dependiente),Proyección exponencial de la población al 1/7/2024[7]​,Total mun- dial (%),Cambio medio anual (%)[8]​,Cambio absoluto anual promedio,Cambio medio abs. total anual (%),Años para even- tual du- pli- ca- ción[9]​,"Censo más reciente, última estimación oficial, proyección de la ONU o reloj de población nacional",Fecha de esta última cifra de población en particular (d/mm/aaaa)[10]​,Tipo[11]​,Enlace o hipervínculo (usualmente de tipo oficial) de esta última cifra de población
0,1,China[12]​,1 408 628 000,1757,-015,-2 077 000,-,-,1 409 670 000,31/12/2023,E,www.stats.gov.cn
1,2,India,1 404 910 000,1753,090,12 669 000,1466,77,1 404 910 000,1/07/2024,A,main.mohfw.gov.in
2,3,Estados Unidos,336 762 000,420,052,1 749 000,202,134,336 836 000,30/07/2024,R,www.census.gov
3,4,Indonesia,288 431 000,360,172,4 959 000,574,41,271 350 000,12/2020,E,www.bps.go.id
4,5,Pakistán,249 805 000,312,256,6 403 000,741,27,241 499 431,1/03/2023,C,www.pbs.gov.pk
5,6,Nigeria,229 931 000,287,273,6 286 000,727,26,223 800 000,1/07/2023,E,cdn.sanity.io
6,7,Brasil,205 122 000,256,052,1 073 000,124,133,203 080 756,1/08/2022,C,censo2022.ibge.gov.br
7,8,Bangladés,174 989 000,218,147,2 580 000,299,47,169 828 911,15/06/2022,C,bdnews24.com
8,9,Rusia[13]​,146 331 000,183,018,257 000,030,396,146 203 613,1/01/2024,E,rosstat.gov.ru
9,10,México,132 552 000,165,118,1 570 000,182,59,126 014 024,15/03/2020,C,www.inegi.org.mx

## PANDAS Y SQL  

vamos a trabajar con SQLAlchemy para ello hay que instalarlo  
    conda install sqlalchemy  
    pip install sqlalchemy

In [77]:
# conda install sqlalchemy desde el terminal de anaconda

In [79]:
import pandas as pd

In [89]:
from sqlalchemy import create_engine

In [81]:
diccionario ={'A':[10,20,30],'B':[40,50,60]}

In [83]:
dataframe = pd.DataFrame(diccionario)

In [85]:
dataframe

    A   B
0  10  40
1  20  50
2  30  60

In [ ]:
#vamos a grabar este dataframe dentro de una base de datos
#creamos un motor en memoria de la base de datos

In [91]:
engine = create_engine('sqlite:///:memory:')

In [93]:
dataframe.to_sql('tabla', engine, index=False)
#index=False le indica que no grabe el index en la tabla

3

In [95]:
#vamos a recuperar los datos, llamamos a la tabla sql desde la conexión engine
datos_leidos_bd = pd.read_sql('tabla',con=engine)

In [97]:
datos_leidos_bd

    A   B
0  10  40
1  20  50
2  30  60

### Ejercicio 1
Desarrolla una función llamada calcular_promedio que tome como entrada un DataFrame de pandas que contiene datos numéricos y calcule el promedio de cada columna. La función debe devolver un nuevo DataFrame que contenga los promedios de cada columna.

In [99]:
import pandas as pd

def calcular_promedio(dataframe):
    promedios = dataframe.mean()
    
    return promedios
    
# Ejemplo de uso
data = {
    'A': [1, 2, 3, 4],
    'B': [5, 6, 7, 8],
    'C': [9, 10, 11, 12]
}
df = pd.DataFrame(data)
resultado = calcular_promedio(df)
print(resultado)

A     2.5
B     6.5
C    10.5
dtype: float64

Seleccionar datos
Desarrolla una función llamada seleccionar_datos que tome como entrada un DataFrame de pandas que contiene información sobre estudiantes (por ejemplo, nombre, edad, calificaciones, etc.) y seleccione un subconjunto de datos basado en ciertos criterios.

Los criterios se pueden basar en el nombre, edad o calificacio  
Utilizar la función query para selecionar datos basados en un criterio proporcionado por una cadena de texto  

Importa la biblioteca pandas con el alias pd.

Define una función llamada seleccionar_datos que tome un DataFrame dataframe y ciertos criterios de selección como argumentos.

Utilizar la función query para selecionar datos basados en un criterio proporcionado por una cadena de texto

Devuelve el subconjunto de datos como un nuevo DataFrame.nes

In [102]:
import pandas as pd

def seleccionar_datos(dataframe, criterio):
    resultado = dataframe.query(criterio)
    return resultado

# Ejemplo de uso
data = {
    'nombre': ['Alice', 'Bob', 'Charlie', 'David'],
    'edad': [20, 22, 18, 25],
    'calificaciones': [90, 88, 75, 95]
}
 
df = pd.DataFrame(data)
criterio = 'edad > 18'
resultado = seleccionar_datos(df, criterio)
print(resultado)

  nombre  edad  calificaciones
0  Alice    20              90
1    Bob    22              88
3  David    25              95

Rellenar Valores Nulos con la Media de una Columna
Desarrolla una función llamada rellenar_con_media que tome como entrada un DataFrame de pandas y el nombre de una columna. La función debe calcular la media de esa columna y luego llenar los valores nulos en esa columna con la media calculada.

In [104]:
import pandas as pd

def rellenar_con_media(dataframe, columna):
    media = dataframe[columna].mean()
    
    # Llenar los valores nulos en la columna especificada con la media calculada
    dataframe[columna] = dataframe[columna].fillna(media)
    
    return dataframe
    
# Ejemplo de uso
data = {
    'nombre': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'edad': [20, None, 18, 25, None],
    'calificaciones': [90, 88, None, None, 95]
}
 
df = pd.DataFrame(data)
columna = 'calificaciones'
 
resultado = rellenar_con_media(df, columna)
print(resultado)

    nombre  edad  calificaciones
0    Alice  20.0            90.0
1      Bob   NaN            88.0
2  Charlie  18.0            91.0
3    David  25.0            91.0
4      Eve   NaN            95.0